sites/main/_posts/2005-04-03-progress-report.html
---
layout: post
title: Progress report
tags:
- coding
- xaraya
---

<p>
Making xaraya react to the <code>mt_keywords</code> MT member was easy with the
existing keywords module. The harder part (read: more time consuming)
was to make the visual presentation of them in the site somewhat
acceptable.
</p>

<p>
If you view this article by itself (what we call the
<b>display</b> view in Xaraya), you'll notice an extra part
on the right side "Related entries" which lists other entries which
have the same keywords attached to them. This allows a reader to
quickly read all entries which have the same or similar
taxonomy. <del>The block isnt fully functional yet, because it reacts to some keywords while it doesn't for others, so there's still
some digging to do there.</del> (FIXED)
</p>

<p>
Outstanding task list:
</p>
<ul class="org-ul">
<li>making Xaraya react on the <code>mt_tb_ping_urls</code> member
</li>
<li>deal with the allow/disallow flags for trackback and comments
</li>
<li>find a home for <code>mt_excerpt</code>
</li>
<li>implement the mt.supportedTextFilters method to allow for markdown
or textile input
</li>
</ul>
